// Создайте массив с элементами 'a', 'b', 'c'. Запишите вместо первого элемента слово, вместо второго - предложение, вместо третьего - новую букву. 
// Массив должен состоять только из строк. Выведите итоговый массив в документ, через всплывающее окно или в консоль.

let arr = ['a', 'b', 'c'];
arr[0] = 'слово';
arr[1] = 'вместо второго - предложение';
arr[2] = 'а';
console.log(arr);
alert(arr);
//document.write(arr);


























// 2. Необходимо создать html-страницу с названием 2.html, в которой подключить файл 2.js (его тоже необходимо создать рядом с html-файлом). 
// В js-файле необходимо создать следующий скрипт:
// Cоздать функцию greeting, которая принимает в качестве аргумента имя человека и выводит приветствие, используя переданное ей имя, 
// в консоль.
// Необходимо у пользователя запросить имя и вызвать функцию greeting, передав туда полученное от пользователя значение.

// greeting();

// function greeting(n) {
//     const name = prompt("Введите Имя: ");
//     return alert(`Привет ${name}, желаю тебе хорошего дня!`);
// }
